{"LatestInterview":[{"date":"3, 4, 5, 6, 7 - Jun - 2019","skills":"Office administration, Front Office/ Receptionist Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Celite Tyre Private Limited, 902, 9th floor, Dev Plaza, S. V. Road, Above Vijay Sales, Andheri (West), Mumbai - 400 058","profile":"Receptionist cum Admin Executive \nCelite Tyre Private Limited","description":"Candidate must have Proven experience as a Financial Manager & CA preferred.Extensive understanding of Banking & financial trends both within the company.Proficient user of finance software-Tally,SAP. Strong interpersonal communication skills. Responsibilities- 1. Greeting and welcoming guests and guide them properly as per their requirement. 2. Maintain register for courier (Inward) & in Excel (Outward). 3. Send mails to concern person for receiving & dispatch of courier etc. Walk-in Date/ Time: 3rd - 7th June , 11 AM onwards Interview Venue: Celite Tyre Private Limited 902, 9th floor, Dev Plaza, S. V. Road, Above Vijay Sales, Andheri (West), Mumbai - 400 058 Landmark: Opposute to Fire Station","location":"Mumbai","experience":"0 - 3 Years"},{"date":"3, 4, 5, 6, 7, 8 - Jun - 2019","skills":"Advance Oracle & PL/SQL Versions 9i,10G and 11G","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Transtreasure Services India Pvt. Limited, G-Block, Building No-1, 1st Floor, Sector- 11, Noida","profile":"Administration Executive \nTranstreasure Services India Pvt. Limited","description":"Candidate should be Any Graduate with having good knowledge of Excel Able to Coordinate with vendors. Handling day to day operation Walk-in Date/ Time: 3rd - 8th June , 10 AM onwards Interview Venue: Transtreasure Services India Pvt. Limited G-Block, Building No-1, 1st Floor, Sector- 11, Noida","location":"Noida","experience":"1 - 3 Years"},{"date":"4, 5 - Jun - 2019","skills":"General Administration, Accounting/ Account Management, Budget Preparation, Event Planning","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Moglix Labs (India) Private Limited, D-188, Sector 10, Noida","profile":"Assistant Manager - Admin \nMoglix Labs (India) Private Limited","description":"Candidate should be Any Graduate/ Post Graduate with 2 to 5 years of experience in General Administration, Accounting/ Account Management, Budget Preparation, Event Planning, Payroll Processing and Vendor Development. Job Responsbility- Supervising day-to-day operations of the administrative department and staff members. Developing, reviewing, and improving administrative systems, policies, and procedures. Ensuring office is stocked with necessary supplies and all equipment is working and properly maintained. Working with accounting and management team to set budgets, monitor spending, and processing payroll and other expenses. Walk-in Date/ Time: 4th - 5th June , 1 PM onwards Interview Venue: Moglix Labs (India) Private Limited D-188, Sector 10, Noida","location":"Noida","experience":"2 - 5 Years"},{"date":"3, 4, 5, 6, 7, 8 - Jun - 2019","skills":"Software Testing, Test Engineering, Test Planning, Creating Test cases","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"NetEdge Computing Solutions Pvt. Limited, Tower C - 56/39, Sector - 62 Noida - 201 301.","profile":"Software Testing Engineer \nNetEdge Computing Solutions Pvt. Limited","description":"The person must have knowledge in: Test case design techniques (Equivalence class partitioning, Boundary value analysis, Test Planning). Carrying out manual testing of the software application & reporting the bugs. Should have good communication skills. The person will be responsible for: Analyzing Business requirements & creating Test cases for various Modules & Test Execution. Reporting bugs with severity & priority according to customer Requirement & project needs. Walk-in Date/ Time: 3rd - 8th June , 11 AM onwards Interview Venue: NetEdge Computing Solutions Pvt. Limited Tower C - 56/39, Sector - 62 Noida - 201 301.","location":"Noida","experience":"1 - 3 Years"},{"date":"2, 3, 4, 5, 6, 7 - Jun - 2019","skills":"customer service non voice process international bpo customer care technical support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"[24]7 Customer Private Limited, Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal Hyderabad - 500 039","profile":"Technical Support Executive \n[24]7 Customer Private Limited","description":"Skills Required: * Good Verbal and Written Communication skills. * Good logical reasoning &analytical skills. * Able to interact with customers via chat, should be able to answer servicing questions. * Able to work in rotational night shifts (US). Eligibility Criteria: * Undergraduate/ Graduate & Postgraduate Freshers & Experienced are eligible to apply. Interview Rounds: * Personal Introduction Round * Online Test * Operations Round Benefits: * Free Transport facility both Pick/ Drop * Life Insurance. * Medical Insurance. Job Designation: Associate and Senior Associate Walk-in Date: 2nd to 7th June 2019 Interview Time: 10 am to 1 pm Venue Address: [24]7 Customer Private Limited, Ground Floor NSL Arena Town Centre, Behind Cricket Stadium, Ramanthapur Road, Uppal Hyderabad - 500 039, Landmark: Next to Bhadra's Grand Contact Person: Srinivas Contact No: 9949244441 NOTE: * Kindly Carry copy of your Resume and ID proof Xerox Copy. * Candidates attended interview within 30 days are not eligible to apply.","location":"Hyderabad","experience":"0 - 3 Years"},{"date":"2, 3, 4, 5, 6, 7 - Jun - 2019","skills":"Technical Support, Service Desk, International Voice Process","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, Diploma, B.A., B.Com, B.B.A, B.Sc","address":"Mphasis Limited, Eon Cluster C: Wing 2, Ground Floor, Kharadi Infrastructure Pvt. Limited.: SEZ, Plot No. 1, Survey 77, MIDC, Kharadi| Pune - 411 014","profile":"Customer Support Executive \nMphasis Limited","description":"Eligibility Criteria: Any Graduate/ Under Graduate 10+2+3 Diploma 1 to 3 years of experience in Service Desk/ International Voice Must have knowledge of CITRIX, Office 365 and VPN.. Knowledge of ticketing tool. Require Skills: Excellent Communication skills (Written & Verbal) Good Analytical, logical and reasoning skills Computer Fundamentals Good keyboard skills needs to be able to toggle between many screens with speed Needs to be able to type with speed and accuracy. Need Immediate joiners.. Walk-in Date/ Time: 31st May - 7th June from 9 AM onwards Interview Venue: Mphasis Limited Eon Cluster C: Wing 2, Ground Floor, Kharadi Infrastructure Pvt. Limited.: SEZ, Plot No. 1, Survey 77, MIDC, Kharadi| Pune - 411 014 You can also call on 8975910700 or email your resume on Suwartik.ramraje@mphasis.com","location":"Pune","experience":"1 - 3 Years"},{"date":"3 - Jun - 2019","skills":"Technical Support, IT Helpdesk, Customer Support","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Tech Mahindra Limited, Bahadurpally, SEZ, Gate-2, Hyderabad","profile":"Technical Support Executive \nTech Mahindra Limited","description":"We are hiring for Technical Support Associate. Looking for candidates who can join us immediately and should have excellent communication skills. Shifts-24/7 Job Responsibilities: Initial point of contact for resolving customer raised network related requests specific to network equipment. Collaborate with other team members on a daily basis in order to achieve a satisfactory resolution to customer issues. Follow Support Center processes for effective management of assigned support requests. Understanding of computer networking - TCP/IP, routing, switching, N+ and CCNA is a plus. Thorough comprehension of fundamental networking protocols including TCP, STP, ARP, Ethernet, OSPF, etc. Diagnose and troubleshoot wireless, security, switching, and other various network-related issues reported by Cisco Meraki customers and partners. Walk-in Date/ Time: 3rd June 2019, 11 AM onwards Interview Venue: Tech Mahindra Limited Bahadurpally, SEZ, Gate-2, Hyderabad","location":"Hyderabad","experience":"1 - 2 Years"},{"date":"3, 4, 5, 6, 7 - Jun - 2019","skills":"Technical Support, International Voice Process, Customer Service","qualification":"B.Sc, BCA/BCS, B.E./B.Tech, B.A., B.Com, B.B.A, B.Sc","address":"Tech Mahindra Limited, Gate No: 1, Opp. Ananth Technologies, Hitech City, Hyderabad","profile":"Technical Support/ IT Service Desk \nTech Mahindra Limited","description":"Eligibility Criteria: Any Graduates,Freshers and Experienced Can Apply Should be Impeccable in Communication Skills Should be flexible to work with 24/7 shifts (Rotational shifts) Should have a decent knowledge on customer service/ Trouble shooting of PCs and Laptops. Candidate should be aware of basic technical knowledge in LAN, WAN and handling basic Internet issues. Troubleshooting of technical related issues and ensure to resolve the issues or queries over the call. Research, diagnose, troubleshoot and identify solutions to resolve customer issues Candidate should be flexible to work in 24*7 environments (Rotational Shift), comfortable to work in night shifts. 5 days working. Transportation Facilities: Both way Salary 2.2 to 4,50,000 LPA (Basis Experience & Last CTC) Interview Date : 3rd to 7th Jun 2019 (Monday-Friday) Timings: 12 PM onwards Venue Details : Tech Mahindra Limited Gate No: 1, Opp. Ananth Technologies, Hitech City, Hyderabad Contact Person: Pooja B Documents required for walk-in: - Copy of CV - Original ID proof (Aadhaar - Mandate)","location":"Hyderabad","experience":"0 - 5 Years"}]}