{"LatestInterview":[{"date":"1 - Jun - 2019","skills":"UI/ Backend, HTML5/ CSS/ Angular 6/ Java 8/ Springboot / MySql","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Gati KWE Plot 20, Survey 12, Kothaguda, Kondapur, Hyderabad - 500 084. Landmark: Opposite CII, Opposite Google Office (Kondapur)","profile":"Java Developer \nGATI-KINTETSU Express Private Limited","description":"GATI-KINTETSU Express Private Limited, is looking for Java Full Stack Sr. Developer: Independently develop UI/ Backend code with HTML5/ CSS/ Angular 6/ Java 8/ Springboot / MySql Good understanding of design principles Write clean code compliant with best practices and standards Good Analytical, Problem Solving and Communication skills Have worked with tools like JIRA and worked in Agile Understands build, deployment process and DevOps process Good to have worked in Microservices architecture Walk-in Date/ Time: 1st June , 9 AM onwards Interview Venue: Gati KWE Plot 20, Survey 12, Kothaguda, Kondapur, Hyderabad - 500084 Landmark: Opposite CII, Opposite Google Office (Kondapur)","location":"Hyderabad","experience":"2 - 7 Years"},{"date":"1 - Jun - 2019","skills":"Core JAVA, Spring, Hibernate, Web Services, Oracle & HTML 5","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CenturyLink Technologies India Private Limited, Salarpuria Touchstone, Fourth Floor, Survey no. 15/3 & 16, Kadubeesana Halli, Varthur Hobli, Outer Ring Road, Bangalore - 560 087","profile":"Java/ J2EE Developer \nCenturyLink Technologies India Pvt. Limited","description":"Candidate should have solid work experience on Core JAVA, Spring, Hibernate, Web Services, Oracle & HTML 5. Must have exposure to JBOSS application server. Very strong problem solving and analytical skills. Knowledge of Telecom transport layer, IP networks is an added advantage Job Responsbility- Design and develop medium sized components based on requirement specification. Produce high quality, maintainable software components code to comply with project quality objectives and company standards. Demo of deliverables to Product Owner & other stake holders at end of each sprint. Exhibit thorough knowledge of agile SCRUM methodology. Experience: 2 to 8 Years Work Location: Bangalore This position requires following skills: ANGULAR 2,4 or 6 NODE JS Core Java 8 (OOPS, Threading, Collections, Streams) Spring Boot and Spring Data (or Hibernate) SQL Knowledge Microservices (REST) GIT And Branching Strategies Junits SonarQube Fundamentals of Microservice Deployments Maven or Gradle Interview Process: Java Online Test, Followed by technical Interviews & Manager Round Interested candidates kindly can walk in for interview on 1st June, 9 AM onwards at below mentioned venue- CenturyLink Technologies India Private Limited. Salarpuria Touchstone, Fourth Floor, Survey no. 15/3 & 16, Kadubeesana Halli, Varthur Hobli, Outer Ring Road, Bangalore - 560 087 Contact Person: Kannan / Sabyasachi","location":"Bangalore","experience":"2 - 8 Years"},{"date":"3, 4, 5, 6, 7 - Jun - 2019","skills":"General Administration, Customer Service, Back Office Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"WNS Global Services Private Limited, 11th FL Block A2 & A3 Building, DLF IT SEZ, Sector 30 NH8 Gurgaon (Near Star Mall)","profile":"Backend - Admin Support Executive \nWNS Global Services Private Limited","description":"WNS Global Services Private Limited, is looking for Backend - Admin Support Executive at Gurgaon location on Immediate basis. Qualification: Any Graduate Years of experience: 1+ Year Candidate should be flexible with the shift Timings. Skill Required: Ability to multi-task and to work within a framework of standard processes Good communication skills (both written and verbal) Ability to grasp requirement and deliver as per understanding Proactive team oriented, flexible approach. Job Responsbility: The role involves B2B interaction, providing Administrative support (arranging, travel, filing expenses, data entry) using the client tools remotely. Walk In Details: Date: 3rd to 7th June' 2019 Timings: 11:00 AM to 4:00 PM Venue Details: WNS Global Services Private Limited 11th FL Block A2 & A3 Building, DLF IT SEZ, Sector 30 NH8 Gurgaon (Near Star Mall) Contact Person: Shalini","location":"Gurgaon","experience":"1 - 3 Years"},{"date":"1 - Jun - 2019","skills":"Java Fresher","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Ionidea Interactive Private Limited, # 38-40, EPIP, Whitefield, Bangalore - 560 066.","profile":"Java Developer/ Fresher \nIonidea Interactive Private Limited","description":"Education: BE/ B.TECH/ MCA/ M. TECH (2017/ 2018 Passouts) Eligibility : Above 60% in UG, PG, 12th and 10th Required Skills: Java Job Location: Bangalore Interested candidates can walk-in directly with a hard copy of your resume- Date of Interview: 1st June 2019 Time: 9.30 AM to 12.30 PM Interview Venue: Ionidea Interactive Private Limited # 38-40, EPIP, Whitefield, Bangalore - 560 066. Besides SAP LABS Landmark: KTPO Stop, Near Ginger Hotel For further clarification, please contact 080-66581500","location":"Bangalore","experience":"0 - 1 Years"},{"date":"1 - Jun - 2019","skills":"Core Java Android Application Development SQLite J2Me JSON","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Kellton Tech Solutions Limited, #1367, Road Number 45, Nandagiri Hills, Jubilee Hills, Hyderabad, Telangana 500033","profile":"Android Developer \nKellton Tech Solutions Limited","description":"Work Experience: 2 to 6 Years Location: Jubilee Hills, Hyderabad Walk-In: 11 AM to 3 PM Work across all phases of app development requirement gathering, code, release, bug fixing. Creating user interface to support smart-phones and tablets of various density/resolutions. Good oral and written communication skills to work with various teams and client personnel, locally and internationally, with minimal supervision. Multitasking, task prioritization, timely completion of tasks and reporting to managers/leads. Essential Experience:- (Resume must have details for below) Good hands on experience in android application development Must have published few android applications on Play Store or other market. (Provide links) Good experience of using REST/JSON web-services, SQLite, Social SDKs in android apps. Use of various IDEs, versioning and tracking tools (e.g. Eclipse, SVN, GIT, JIRA etc.) Essential Skills:- Strong fundamentals in Core Java, OOPS and various Android Components and APIs. Must have good problem solving, debugging and optimization skills. Good understanding of DBMS, SQL, data structures, algorithms & complexity. Work with Services, Location, Animation, Fragments etc in android. Add On Experience and Skills:- Work with ProGuard, MAT(Memory Analyzer Tool) Experience with J2ME/ Blackberry mobile apps or with JEE bases web-services. Walk-in Date/ Time: 1st June , 11 AM onwards Interview Venue: Kellton Tech Solutions Limited #1367, Road Number 45, Nandagiri Hills, Jubilee Hills, Hyderabad, Telangana 500033 Interested Candidates can share their updated resume on hiring@kellton.com","location":"Hyderabad","experience":"2 - 6 Years"},{"date":"3 - Jun - 2019","skills":".Net, ASP .Net, C#, SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Snap-on Business Solutions (India) Pvt. Limited, 1st floor, Tower C, Logix Techno Park Plot No. 5, Sector 127, Noida","profile":"ASP .Net/ C# Developer (Fresher) \nSnap-on Business Solutions (India) Pvt. Limited","description":"REQUIREMENTS: Must be B.Tech/ B.E/ M.tech/ MCA (CS/ IT Stream only) 18/19 batch with 60% overall and regular academic background. Good OOPs concept and its implementation. Good Asp.net and C# programming skills. Must have done any training/internship/project on Asp.net. Good communication skills in English. Good analytical skills. Interested candidates can directly walk in on Tuesday 4th June 2019 at 11.00 Am sharp. Candidates reaching after 11.30 Am, would not be entertained . Venue: Snap-on Business Solutions (India) Pvt. Limited 1st floor, Tower C, Logix Techno Park Plot No. 5, Sector 127, Noida Rounds of Interviews: 1- Aptitude Test (Written) 2- Written English communication Test Please Note: 1. Candidate should be ready to sign a service agreement of 1.5 years. 2. Please do not apply those candidates who have already attended any interview process at our company in last 6 months.","location":"Noida","experience":"0 - 1 Years"},{"date":"1 - Jun - 2019","skills":"Java, Object-Oriented Programming, MVC, JDBC, and RESTful","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"I-admin Outsourcing Private Limited, #595, SLA Arcade, 2nd Floor, 15th Cross, Outer Ring Road J P Nagar, 1st Phase, Bangalore - 560 078","profile":"Software Engineers (Java) \nI-admin Outsourcing Private Limited","description":"Qualification: Bachelors/ Postgraduate Degree (Preferably in CS/ IT) Experience: 1 to 3 years Knowledge & Skills: Proficient in Java, with a good knowledge on all new updates in Java Solid understanding of object-oriented programming. Familiar with various design and architectural patterns. Skill for writing reusable Java libraries. Familiarity with concepts of MVC, JDBC, and RESTful Experience with popular web application frameworks, such as Spring 4.3, Hibernate, Struts. Experience with popular Database query writing skills such as Oracle, MYSQL. Good in writing clean, readable Java code Basic understanding of JVM, its limitations, weaknesses, and workarounds Implementing automated testing platforms and unit tests (JUNIT) Proficient understanding of code versioning tools - Git Familiarity with build tools - Ant, Maven, and Gradle Roles & Responsibilities: Translate application use cases into functional applications. Design, build, and maintain efficient, reusable, and reliable Java code Ensure the best possible performance, quality, and responsiveness of the applications Identify bottlenecks and bugs, and devise solutions to these problems Help maintain code quality and Automation Qualifications & Experience Walk-in Date/ Time: 1st June 2019, 9 AM onwards Interview Venue: I-admin Outsourcing Private Limited #595, SLA Arcade, 2nd Floor, 15th Cross, Outer Ring Road J P Nagar, 1st Phase, Bangalore - 560 078 Land Mark: Opp. GOOMO Building Contact Person: Rajeshwari Contact No : 080-26635622","location":"Bangalore","experience":"1 - 3 Years"},{"date":"3, 4, 5, 6, 7 - Jun - 2019","skills":"ASP .Net, C#, SQL Server 2008, Javascript, Jquery, Reporting Services, Web Services, WCF, HTML","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Koenig Solutions Private Limited, 2nd Floor, KLJ Complex-II, Plot No. 70, Opp. Police Station, Moti Nagar, New Delhi - 110 015","profile":"ASP .Net Developer \nKoenig Solutions Private Limited","description":"Minimum 6 months of experience in ASP .Net 3.5, 4.0, 4.5 with C# SQL Server 2008, Javascript, Jquery, Reporting Services, Web Services, WCF, HTML Ability to work along with development team to ensure timelines & quality deliveries. Job Responsibility- Design implement & support highly applications and web services using Microsoft technologies ASP .NET, C#, SQL Server Mentor New joiners in the team. Walk-in Date/ Time: 3rd June - 7th June , 9 AM onwards Interview Venue: Koenig Solutions Private Limited 2nd Floor, KLJ Complex-II, Plot No. 70, Opp. Police Station, Moti Nagar, New Delhi - 110 015","location":"Delhi","experience":"1 - 6 Years"},{"date":"1 - Jun - 2019","skills":"Core Java, Spring, Spring Boot, Angularjs, Javascript, J2Ee, Struts","qualification":"B.Sc, BCA/BCS, B.E./B.Tech","address":"Victory HR Consultants, Moores Garden, No: 13, Moores Road, Near Asan Memorial School, Thousand Lights, Chennai - 6","profile":"Java Developers \nVictory Human Resource Consultants","description":"A Leading Software Company in Chennai requires Java Developers for Immediate Placement Candidate should be Graduate with 1 to 3 years of relevant experience in Java Fresh Graduates Those Who Have Finished Their Java Course Can Apply Immediate Joiners ONLY Apply Walk-in Date/ Time: 1st June 2019, 9 AM onwards Interview Venue: Victory HR Consultants, Moores Garden, No: 13, Moores Road, Near Asan Memorial School, Thousand Lights, Chennai - 6","location":"Chennai","experience":"0 - 3 Years"},{"date":"1 - Jun - 2019","skills":"Core Java, Hibernate, Spring, Struts, Design Patterns, Multithreading","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Virtusa Consulting Services Pvt. Limited, Foundation Building, No 34 IT Highway, Rajiv Gandhi Salai , Navallur, Chennai - 600 130","profile":"Java Developers \nVirtusa Consulting Services Pvt. Limited","description":"We have urgent requirement for Java Developers with working knowledge on Framework, Collections & Design Patterns. Work Experience: 2 to 4 Years Job location: Chennai - Navallur Looking only for Immediate to 30 Days Joiners. Required Skills- Should have strong work Experience on Core Java, Collections & Design Patterns. Hands on experience in Struts, Spring , hibernate. Good to have project experience on Multi-Threading. Hands on experience in oracle database. Candidate should have development project experience. Self-starter and good communicator. Should have handled teams with end to end ownership of design and delivery. Candidate who suffice the above skills please drop into below address. Walk-in Date - 1st June 2019 Time - 9:30 AM - 1 PM Venue Details: Virtusa Consulting Services Pvt. Limited Foundation Building, No 34 IT Highway, Rajiv Gandhi Salai , Navallur, Chennai - 600 130 Contact Person - Anand Please bring your updated resume, photo ID proofs, Employment Docs and Passport size photo. Shortlisted candidate offer will be released on the date of interview itself.","location":"Chennai","experience":"2 - 4 Years"},{"date":"1 - Jun - 2019","skills":"Java","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Vyom Labs Private Limited Sunrise Business Park, Near Cummins Campus, Balewadi Pune.","profile":"Java Developers \nVyom Labs Private Limited","description":"Experience: 1-2 Years Java experience Job Profile: Selected candidates will be trained in Salesforce platform and applications for 1-2 months and then assigned to Salesforce implementation projects as developers /consultants. Skills Required: Very good programming skills in Java Very good English communication skills Good Aptitude, analytical and problem solving skills are necessary Experience combining analysis, design, development and implementation of object oriented (OO) concept based applications Base location would be Pune but willing to travel at short notice Ability to learn new skills and work independently at customer location Willing to work in shifts and projects based travel. Project duration can range from 3 months to year. Candidates who are willing to relocate and work in shifts according to project requirements can apply. Walk-in Date/ Time: 1st June , 9 AM onwards Interview Venue: Vyom Labs Private Limited Sunrise Business Park, Near Cummins Campus, Balewadi Pune. Mode of interview : Java test Technical interview Managerial interview","location":"Pune","experience":"1 - 2 Years"},{"date":"1, 3, 4, 5, 6, 7, 8, 10, 11, 12, 13, 14, 15 - Jun - 2019","skills":"Android, Rest API, Butterknife, Mysql, Rx Java, Dagger","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"DUTCHUNCLE TECH SOLUTIONS PVT. LIMITED, B 358-A, 2nd Floor, R.S Tower, New Ashok Nagar Road, Block B, New Ashok Nagar, New Delhi - 110 096","profile":"Android Developer \nDUTCHUNCLE TECH SOLUTIONS PVT. LIMITED","description":"Job Responsbility: Building the advanced design Mobile applications for the Android platform. Design, define and ship new features in mobile application. To platform unit test to ensure Usability, Robustness, Edge cases, and General Reliability To work and make sure improved Application Performance and bug fixing Continuous evaluation, Discovery, and implementation of new technologies to maximize the efficiency of development. Key Requirements: Must Knowledge of Rest API, Butterknife Mysql, Rx Java, Dagger Walk-in Date/ Time: 1st June - 15th June , 10 AM onwards Interview Venue: DUTCHUNCLE TECH SOLUTIONS PVT. LIMITED B 358-A, 2nd Floor, R.S Tower, New Ashok Nagar Road, Block B, New Ashok Nagar, New Delhi - 110 096","location":"Delhi","experience":"1 - 3 Years"},{"date":"3 - Jun - 2019","skills":".Net SQL Server","qualification":"B.E./B.Tech","address":"KPMG Global Services Private Limited, 1st Floor- HR Interview Area, RMZ Ecoworld, Campus 7, Devarabeesnahalli, Marathalli Outer Ring Road, Bangalore - 560 103","profile":".Net Trainee - Engineer \nKPMG Global Services Private Pvt Limited","description":"For one of the project on CSR Portal development, we are looking to hire interns for a period of 3 months to join immediately. Eligibility Criteria: BE/ B.Tech (Computer Science) Graduate 2017 or 2018 pass outs with 0 years of experience Can join immediately The interns need to be B.Tech in computer science with working knowledge in SQL Server and .NET. If you are meeting the above criteria, request you to please attend the interview on Monday, 3rd June and share your resume at khushboosinha@kpmg.com. Please write 'Confirmed to attend interview on 3rd June' while sending your resume. Interview Date: Monday, 3rd June 2019 Registration Time: 9:30 AM-10:00 AM Venue: KPMG Global Services Private Limited 1st Floor- HR Interview Area, RMZ Ecoworld, Campus 7, Devarabeesnahalli, Marathalli Outer Ring Road, Bangalore - 560 103 HR POC: Rajiv Gowda/ Khushboo Sinha","location":"Bangalore","experience":"0 - 1 Years"},{"date":"2 - Jun - 2019","skills":"Core Java, J2EE, Spring / Hibernate","qualification":"B.E./B.Tech, M.Tech","address":"HCL Technologies Limited HCL Electronic City, Surya Sapphire","profile":"Java Professionals \nHCL Technologies Limited","description":"We have planed for a Weekend drive on 2nd Jun-2019 (Sunday) at Electronic city, surya sapphire,Bangalore location to close New positions from our Premium US banking customer, interested candidates are requested to share your profile along with below basic information. Experience: 1 to 2.5 Years Job Location : Bangalore No.of Position in Open : 50 Salary : Best in the Market Required Skills: Good Experience in Core Java Good Experience in J2EE Good Experience in Spring / Hibernate Excellent Communication and Attitude. Educational Qualification : UG should be only from BE &BTech Training will be provided for Java Full Stack Role Interview Process : Technical online test and 1 Rounds of Technical Interviews followed by a HR discussion. Venue : HCL Technologies Limited HCL Electronic City, Surya Sapphire SPOC : Bhavya Shree Kindly confirm whether you are available for this Face to face Interview on 2nd Jun-2019 (Sunday). Revert us with your updated CV if your Interested with the following details to Email ID: j-chaithra@hcl.com Name : Contact No : Email ID : Highest Qualification : Current Company : Contract or Permanent: If Contract Pls do mention Payroll company name : Total years of Experience : Relevant years of Experience in Java : Relevant Years of experience in J2EE : Relevant Years of experience in Spring : Relevant Years of experience in Hibernate : Relevant Years of experience in Webservices (if any) : Current CTC : Expected CTC : Notice period : Available for F2F interview on 2nd Jun-2019 ( Yes / No ) : Current Location : Please feel free to contact us if you have any doubt in the requirement. Email : j-chaithra@hcl.com Kindly Ignore this mail if you are not interested and not relevant to your profile. Also please refer your friends if they have same skill set. Documents to be carried: 2 Resume, 2 Photograph, Last month payslilp. 1 ID proof photocopy (mandate).","location":"Bangalore","experience":"1 - 3 Years"},{"date":"1 - Jun - 2019","skills":"Javascript Algorithms Node.Js Rest JSON IntelliJ Java","qualification":"B.E./B.Tech","address":"Riversand Technologies India Pvt. Limited, IBC Knowledge Park, Tower D, 8th Floor. 4/1, Bannerghatta Main Rd, Bengaluru - 560 029","profile":"Junior Java Developer \nRiversand Technologies India Pvt. Limited","description":"Required Education: B.E, B.Tech or higher in Computer Science or comparable discipline Required Experience: Minimum of 2 years in Java / C# / Scala development Required Skills & Knowledge: Strong analytical and logical skills Thorough knowledge of Data Structures & Algorithms Strong OO Programming and OO Design concepts knowledge Knowledge of Scala programming language concepts Experience developing REST / JSON applications Experience developing in Node.js & JavaScript Strong unit/integration testing experience Need to be a team player and work with minimum supervision Candidate must be a career-oriented individual with strong communications and organizational skills. Desired Skills & Knowledge: Working knowledge of following technologies Apache Spark, Azure Blob Storage, Databricks, Apache Kafka, Apache Storm, Elastic Search Hands-on experience of Intellij / Eclipse and Github. Worked for a product company solving business problems than IT products. Working knowledge of multi-threaded applications Walk-in Date: 1st June 2019 Time: Between 9:30am and 1pm only Venue: Riversand Technologies India Pvt. Limited, IBC Knowledge Park, Tower D, 8th Floor. 4/1, Bannerghatta Main Rd, Bengaluru - 560 029","location":"Bangalore","experience":"2 - 5 Years"},{"date":"1 - Jun - 2019","skills":"Core JAVA, Spring, Hibernate, Web Services, Oracle & HTML 5","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CenturyLink Technologies India Private Limited, Green Boulevard Block B, 5th Floor Plot No. B, 9A, Sector 62, Noida, Uttar Pradesh","profile":"Java/ J2EE Developer \nCenturyLink Technologies India Pvt. Limited","description":"Candidate should have solid work experience on Core JAVA, Spring, Hibernate, Web Services, Oracle & HTML 5. Must have exposure to JBOSS application server. Very strong problem solving and analytical skills. Knowledge of Telecom transport layer, IP networks is an added advantage Job Responsbility- Design and develop medium sized components based on requirement specification. Produce high quality, maintainable software components code to comply with project quality objectives and company standards. Demo of deliverables to Product Owner & other stake holders at end of each sprint. Exhibit thorough knowledge of agile SCRUM methodology. Experience: 2 to 8 Years Work Location: Bangalore This position requires following skills: ANGULAR 2,4 or 6 NODE JS Core Java 8 (OOPS, Threading, Collections, Streams) Spring Boot and Spring Data (or Hibernate) SQL Knowledge Microservices (REST) GIT And Branching Strategies Junits SonarQube Fundamentals of Microservice Deployments Maven or Gradle Interview Process: Java Online Test, Followed by technical Interviews & Manager Round Interested candidates kindly can walk in for interview on 1st June, 9 AM onwards at below mentioned venue- CenturyLink Technologies India Private Limited Green Boulevard Block B, 5th Floor Plot No. B, 9A, Sector 62, Noida, Uttar Pradesh","location":"Noida","experience":"2 - 7 Years"},{"date":"1 - Jun - 2019","skills":"Cucumber JUnit Java Selenium SQL Automation Testing Javascript","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hexaware Technologies Pvt. Limited, Plot No. H5 SIPCOT IT PARK, Navallur Post, Siruseri - 603103, Kanchipuram Dt, Chennai.","profile":"Automation Selenium/ Java Testing \nHexaware Technologies Pvt. Limited","description":"Hexaware Technologies is looking for Automation testing - Selenium Java professionals with 4-8 years experience. We are looking for nothing but the best! Join our team if you have the passion for working on cutting edge technologies and a drive to transform the customers business. Person should have minimum 4 year of experience in Java & JavaScript. Should have hands on experience in BDD / Behavior-Driven Development framework like Cucumber, JBehave. Should have experience in Agile Methodologies. Experience in Junit are highly preferred. Good Selenium resource with Java Expertise in debugging code and exception handling Good knowledge in API calls through jar and capture response Fair understanding of Automation Test plan/ Strategy Knowledge in SQL is added advantage Preferred Immediate Joiners Open to work in 2nd shifts (1pm -10pm) Good English communication skills Interview Date: 1st June 2019 Time: 9.00 am - 1.00 pm Venue Details: Hexaware Technologies Pvt. Limited Plot No. H5 SIPCOT IT PARK, Navallur Post, Siruseri - 603103, Kanchipuram Dt, Chennai. Contact person: M.Dhamodaran Please forward your resumes to DhamodaranM@hexaware.com","location":"Chennai","experience":"4 - 8 Years"},{"date":"1, 3, 4, 5, 6, 7, 8 - Jun - 2019","skills":"Back Office, Data Processing, Customer Support, General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Jupiter Infomedia Limited, 336, Laxmi Plaza, Laxmi Industrial Estate, New Link Road, Andheri-West, Mumbai - 400 053","profile":"Back Office Executive \nJupiter Infomedia Limited","description":"Candidate should be Any Graduate with good knowledge of computer & internet Must be well versed with Word & Excel, Internet & emailing. A positive attitude to dealing with people. Should be capable of working with team. Able to read & write in English Job Responsbility- Check, verify & manage the data base Voice Process, domestic Calling, tele Caller, customer Calling, Customer Care Executive Co-ordinate with various departments for getting the data. Walk-in Date/ Time: 25th May - 8th June, 11 AM onwards Interview Venue: Jupiter Infomedia Limited, 336, Laxmi Plaza, Laxmi Industrial Estate, New Link Road, Andheri-West, Mumbai - 400 053","location":"Mumbai","experience":"0 - 2 Years"},{"date":"15 - Jun - 2019","skills":"Application Testing, Acceptance Testing, Quality Assurance","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Hotel Trident, Hitech City Main Road, HITECH City, Near Cyber Towers, Madhapur, Hyderabad, Telangana - 500 081","profile":"Manual Testers \nNavigant BPM (India) Private Limited","description":"Opening for Manual Testers with 2 - 7 Years of relevant experience 1) Manual Tester (SQL) 2) Manual Tester (Scrum) 3) SQL + ETL Tester 4) Python Tester Job Responsbility- Communicate test progress, test results, and other relevant information to manager. Coordinates on QA and UAT process within the team Reviews architecture and technical specifications for conflicts or issues that could affect quality Performs acceptance testing and manages user testing when needed Travel to meet teammates, partners, business owners, and users when required. Work Location: Trivandrum, Kerala Interested candidates may walk-in on 15th June from 9 AM onwards at the below mentioned venue- Hotel Trident, Hitech City Main Road, HITECH City, Near Cyber Towers, Madhapur, Hyderabad, Telangana - 500 081","location":"Hyderabad","experience":"2 - 7 Years"},{"date":"1, 3, 4, 5, 6, 7, 8 - Jun - 2019","skills":"HR Administration, Recruitment, Interviewing and General Administration","qualification":"B.A., B.Com, B.B.A, B.Sc, MBA/PGDM","address":"Accord Selection Services, 402, 4th Floor, Centre Square, Opp. Bharat Petrol Pump, S.V. Road, Near Station, Andheri (West), Mumbai - 400 058","profile":"HR Cum Admin Executive \nAccord Selection Services","description":"Vandidate should be Any Graduate/ MBA (HR) with 3 to 5 years of experience in HR Administration, Recruitment, Interviewing and General Administration. Must have excellent English communication skills Advance MS Excel Letter Correspondence Handling Recruitment & General Administration Age below 35 years Trading Company experience preferred Walk-in Date/ Time: 30th May - 30th June , 10 AM onwards Interview Venue: Accord Selection Services 402, 4th Floor, Centre Square, Opp. Bharat Petrol Pump, S.V. Road, Near Station, Andheri (West), Mumbai - 58","location":"Mumbai","experience":"3 - 5 Years"},{"date":"31 - May - 2019","skills":"Facility Management, Transport Management, Housekeeping Management","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Hexaware Technologies Limited, Phase 3, Hinjewadi, Rajiv Gandhi Infotech Park, Hinjewadi, Pune, Mahharashtra - 411 057","profile":"Admin Executive/ Admin Lead \nHexaware Technologies Limited","description":"Walk-in Drive for Admin Executive/ Admin Lead - Hexaware Technologies Limited Shift Timings : Rotational Shifts Job Location: Pune Person should have experience working as a Admin Executive or Admin Lead. Should have handled facilities management, transport management, housekeeping management. Should have minimum 2 years of experience into Administration. Interview Date: 31st May 2019 Timing : 11:00 AM - 5:00 PM Interview Venue: Hexaware Technologies Limited, Phase 3, Hinjewadi, Rajiv Gandhi Infotech Park, Hinjewadi, Pune, Mahharashtra - 411 057 Contact Person - Shruti - 9011394047, 020 67918660 Neha Shaikh - 7021325179 Email ID - Shrutid2@hexaware.com/ Nehas4@hexaware.com While coming please bring your updated resume, Aadhar card or Pan card, current company offer letter, last 3 months salary slips and increment letter.","location":"Pune","experience":"2 - 5 Years"},{"date":"7 - Jun - 2019","skills":"General Administration, Office Coordination, Asset Management, Customer Support","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"Syncfusion Software Private Limited, Eymard Complex, AJ-217, 4th Avenue, Shanthi Colony, Anna Nagar, Chennai - 600 040.","profile":"Office Coordinator / Admin \nSyncfusion Software Private Limited","description":"Eligibility: Any degree (Regular) Freshers only need to apply 2017 & 2018 pass-outs with minimum 60% in all academics No gaps of any kind Well versed in MS-Office Good communication skills Experience 0 - 1 year in relevant field Females only Roles: General office maintenance \\ admin tasks Maintenance of employee records Asset management Inventory record maintenance Customer support coordination Any other duties assigned Working Hours: 9:00 AM to 6:00 PM Saturdays working (As needed) Interview Date: June 7, 2019 Timings: 10 AM to 2 PM Interview Venue: Syncfusion Software Private Limited, Eymard Complex, AJ-217, 4th Avenue, Shanthi Colony, Anna Nagar, Chennai - 600 040. Landline : 044-26210413 Extension : 413","location":"Chennai","experience":"0 - 1 Years"},{"date":"3, 4, 5, 6, 7, 8, 10, 11, 12, 13, 14 - Jun - 2019","skills":"Software Testing, Test Engineering, Automation Testing, Selenium, API, Performance Testing","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Successive Technologies, E-29, SECTOR-11 NOIDA - 201 301","profile":"Automation Tester \nSuccessive Software Private Limited","description":"Successive Software is looking for Quality Assurance: Software Testers to work on multiple products, technologies, and environments, documenting and recording high-quality test cases. Our software testers are expected to be able to walk through features or products and identify problems, file bugs in a product with a detailed description of the path of arrival to the bug as well as the bug itself. Skill Set Required: Automation Testing Selenium, API and test case documentation Performance Testing is good to have. Experience designing and updating test campaigns based on formal/ informal requirements Team player, methodical, pragmatic, self-starter, process-driven and results oriented. Should have excellent communication abilities in English. Walk-in Date/ Time: 3rd - 14th June, 10 AM onwards Interview Venue: Successive Technologies, E-29, SECTOR-11 NOIDA-201301","location":"Noida","experience":"2 - 5 Years"},{"date":"31 - May - 2019","skills":"General Administration, Leave/ Attendance Management, Office Administration, Receptionist/ Front Desk Activities","qualification":"B.A., B.Com, B.B.A, B.Sc","address":"V Protect Powered By SIS Prosegur Pvt. Limited, Plot No. 10 , GNG Tower 4th Floor, Sector -44 Gurgaon (Nearest Metro Station Huda City Center)","profile":"Admin Executive \nV Protect Alaram Monitoring & Response Services Pvt. Limited","description":"Candidate should be Any Graduate with 1 to 4 years experience in General Administration, Leave/ Attendance Management, Office Administration, Receptionist/ Front Desk Activities. Must be Computer literate with programmes such as word, excel, etc. Should have good organisational skills and ability to prioritise. Interpersonal skills with good communicative skills Job Responsbility- Responsible for managing entire day today admin activities, Ticket bookings, hotel bookings for the clients and for business trips Forming and maintaining employee records Updating databases internally, such as attendance and leave records. Preparing and amending necessary documents, i.e. Vendor contracts. Communicating with external partner Assisting with payroll by providing the department with relevant employee information, i.e. holiday and sick days taken Helping with various arrangements internally, from travel to processing expenses Walk-in Date: 31st May 2019 Timings : 1100 am- 2:00 pm only Interview Venue: V Protect Powered By SIS Prosegur Pvt. Limited Plot No. 10 , GNG Tower 4th Floor, Sector -44 Gurgaon (Nearest Metro Station Huda City Center) Contact Person Pallavi Bhatnagar Contact No. 9899206328","location":"Mumbai","experience":"1 - 4 Years"},{"date":"1 - Jun - 2019","skills":".NET 4.0 ASP .NET, C#, LINQ, AJAX","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"eClerx Services Limited, Mindspace, Bulding No 11, 5th & 6th Floor, K Raheja Mindspace, Plot # 3, TTC Industrial Area, Thane Belpur Road, Airoli, Navi Mumbai, Maharashtra - 40 0708","profile":".Net MVC Developer \neClerx Services Limited","description":"Work Experience: 3 to 7 Years Skills / Experience Required: a) .NET 4.0 ASP .NET, C#, LINQ, AJAX b) Knowledge on WCF, Web Services, design patterns, jquery, javascript c) Visual studio 2008/2012/13 d) SQL server 2008/2012 Good to haves a) MVC (MVC & SQL) Key Competencies Technology 1 Asp.Net & C# Technology 2 SQL Roles & Responsibilities: Extensive knowledge of Software Development Life Cycle (SDLC) and have worked using Water-Fall and Agile methodologies. Expertise in Microsoft .NET technologies such as Visual Studio .NET, C#, ASP .NET, Web Forms, AJAX, ADO .NET, VB Net, WCF, Microsoft SQL Server, SSIS, SSRS and SSAS. Experience in Designing, Modeling and Development of Database using SQL Server 2000/ 2005/ 2008. Have worked on highly complex Stored Procedures and Functions. Strong knowledge of Object Oriented Design Methodologies and OOPs along with SOA. Walk-in Date/ Time: 1st June , 10 AM onwards Interview Venue: eClerx Services Limited Mindspace, Bulding No 11, 5th & 6th Floor, K Raheja Mindspace, Plot # 3, TTC Industrial Area, Thane Belpur Road, Airoli, Navi Mumbai, Maharashtra - 40 0708","location":"Mumbai","experience":"3 - 7 Years"},{"date":"1 - Jun - 0","skills":".Net, C#, MS SQL , WCF, WPF, Windows Services, Knowledge of Multi-Threading","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Arya Omnitalk Wireless Solutions Pvt. Limited, 2nd Floor, Office No. 202,Summer Court Building, Magarpatta City, Pune - 411 013","profile":".NET Professionals \nAryaOmnitalk Wireless Solutions Pvt. Limited","description":"Position 1: .Net, C#, Javascript, Jquery, Ajax, MS SQL, MVC Position 2: .Net, C#, MS SQL , WCF, WPF, Windows Services, Knowledge of Multi-Threading Number of Position:- 15 Date & Day: Saturday, 1st June 2019 @ 9:30 Am Interview Time: 9:30 AM Mode Of Interview: Personal- Face to Face Interview Location- Arya Omnitalk Wireless Solutions Pvt. Limited 2nd Floor, Office No. 202, Summer Court Building, Magarpatta City, Pune - 411 013 Contact Person- Rohit Contact No- 7757 091337 Original Documents to be carried 1. Government ID Proof 2. Updated Resume Instruction Reporting Time for Interview: 15 Min Before the interview Starts. Candidates who have given the interview in the last 6 months, Please do not Apply","location":"Pune","experience":"3 - 6 Years"},{"date":"3, 4, 5, 6, 7 - Jun - 2019","skills":".Net, ASP .NET framework, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Spigot Software Private Limited, 531/144, 3rd Floor, 1st Sector, HSR Layout, Outer Ring Road, Agara, Bangalore - 560 102","profile":".Net Developer \nSpigot Software Private Limited","description":"Candidates should be expert in .NET web framework. Strong understanding of object-oriented programming. Experience creating database schemas that represent and support business processes. Knack for writing clean, readable, and easily maintainable code. Expert in .NET web framework. Familiarity with the ASP .NET framework, SQL Server and design/architectural patterns (e.g. Model-View-Controller (MVC)) Walk-in Date/ Time: 3rd June - 7th June , 10 AM onwards Interview Venue: Spigot Software Private Limited 531/144, 3rd Floor, 1st Sector, HSR Layout, Outer Ring Road, Agara, Bangalore - 560 102","location":"Bangalore","experience":"1 - 6 Years"},{"date":"1 - Jun - 2019","skills":".Net Framework, C#/ VB .Net, ASP .Net, SQL Server 2005/ 2008","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Progressive Digital Media (Sister company of GlobalData) 2nd Floor, NSL Centrum, Plot No-S1, Phase 1 and 2 KPHB Colony, Opposite: BSNL Office Hyderabad.","profile":"Senior .Net Developer \nGD Research Center Pvt. Limited (GDRC)","description":"Minimum 3 years of experience in .Net Framework, C#/ VB .Net, ASP .Net, SQL Server 2005/ 2008 Well-versed with JavaScript, AJAX, Web services, Threading Have strong concepts of OOPS. Hands on experience in product/ project development using MVC Exposure of Endeca Configuration, NHibernate, JQuery etc., Strong database programming skills (T-SQL) Good communication skills in English, both written and verbal and analytical skills. Bachelors Degree in Engineering /Technology / MCA. Understanding of web usability issues and information architecture. Strong interpersonal and communication skills. Able to work and thrive in a fast-paced team environment and flexible to accommodate demanding Project schedules. Ability to express technical concepts clearly to people with no technical background Walk-in Date/ Time: 1st June 2019, 10 AM onwards Interview Venue: Progressive Digital Media (Sister company of GlobalData) 2nd Floor, NSL Centrum, Plot No-S1, Phase 1 and 2 KPHB Colony, Opposite: BSNL Office Hyderabad. Land Mark - Above Brand Factory and Reliance Trends, Near to Malaysian township Circle","location":"Hyderabad","experience":"3 - 6 Years"},{"date":"1 - Jun - 2019","skills":".Net Framework 4+ .Net Core MVC WebAPI Micro Service, MS SQL","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"CES IT Private Limited, 1st Floor, West wing Beta Block, SSPDL Building, Old No. 25, Rajiv Gandhi Salai, OMR, Navalur, Chennai - 603 103.","profile":"Senior .Net Developer/ Lead \nCES IT Private Limited","description":"Skills Required: Needs these skills and minimum of 3 years experience: .Net Framework 4+ .Net Core MVC WebAPI Micro Service Database (MS SQL, PostgresSQL, NoSQL) Front End technologies (Angular, React) Cloud technologies (AWS, Azure, Google) Should have excellent communication skills Hands-on experience is .NET Basic Knowledge in Angular and Cloud Immediate to 60 Days Shift Timings : 1 PM to 10 PM Cab Facility Available Walk-in Date/ Time: 1st June , 10 AM onwards Interview Venue: CES IT Private Limited 1st Floor, West wing Beta Block, SSPDL Building, Old No. 25, Rajiv Gandhi Salai, OMR, Navalur, Chennai - 603 103.","location":"Chennai","experience":"4 - 9 Years"},{"date":"1 - Jun - 2019","skills":"Angular JS, HTML, JS, CSS, Ajax, Jquery, C#, ASP .NET, Oracle, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Osource India Private Limited, Rupa Solitaire, A Wing, 6th Floor, Office No. C619, Plot No. A-1, Sector - 1, Millennium Business Park, Mahape, Navi Mumbai - 400 710","profile":".Net/ Mobile Developer \nOsource India Private Limited","description":"1) Mobile Developer Required Skills: Experience in Native and Hybrid Development (Ionic 3) Sound Angular JS, HTML, JS, CSS, Ajax, Jquery knowledge 2) Software Developer Required Skill Set: Basic Programming (C#, ASP .NET, Oracle, SQL Server) jQuery Walk-in Date/ Time: 1st June 2019, 10 AM onwards Interview Venue: Osource India Private Limited Rupa Solitaire, A Wing, 6th Floor, Office No. C619, Plot No. A-1, Sector - 1, Millennium Business Park, Mahape, Navi Mumbai - 400 710","location":"Mumbai","experience":"1 - 3 Years"},{"date":"1 - Jun - 2019","skills":"ASP .NET MVC, C# .NET, ASP .NET , MVC 3.0/ 4.0","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Logicsoft International Private Limited, 464, 2nd Floor, Udyog Vihar- Phase 5, GURGAON, Haryana - 122 016","profile":"ASP .Net Developer \nLogicsoft International Private Limited","description":"We urgently required ASP .Net Developer, who has strong Asp .Net with MVC technical skills. We need candidate who can join in 15 days. Good Salary Package. Person should have 2 to 3 years of working experience in ASP .Net technologies with MVC Must have hands on coding in C# .NET, ASP .NET , MVC 3.0/4.0 Must have working knowledge on Entity Framework Must have working knowledge on Web Services and WCF Must have working knowledge on JQuery, HTML, DHTML and Java Script Must have strong knowledge on SQL Database Server Working experience with source controls i.e. VSS, TFS or SVN Should be a Team Player as well as Individual Contributor Should have worked atleast in 3 to 4 live projects Proven understanding of the SDLC If you are interested please come for interview on mentioned date and time. Walk-in Date: 1st June 2019 Time - 10:30 am to 4:00 pm Interview Venue: Logicsoft International Private Limited 464, 2nd Floor, Udyog Vihar- Phase 5, GURGAON, Haryana - 122 016","location":"Gurgaon","experience":"2 - 3 Years"},{"date":"1 - Jun - 2019","skills":"Performance Testing, Loadrunner or Jmeter","qualification":"B.E./B.Tech, MCA/PGDCA","address":"Maveric Systems Limited, KISCOL GRANDS, No. 245, A, Dr. Rajendra Prasad Road Tatabad, Coimbatore - 641 012","profile":"Performance Testing Engineer \nMaveric Systems Limited","description":"Candidate should have strong hands on experience in Performance Testing, Loadrunner or Jmeter Years of Experience: 2 - 5 Years Work Location : Chennai Walk-In Interview: Date: 1st June 2019 Time: 10 AM to 4 PM Venue: Maveric Systems Limited KISCOL GRANDS, No.245, A, Dr. Rajendra Prasad Road Tatabad, Coimbatore - 641 012 Land Mark : Near Aachi Mess","location":"Coimbatore","experience":"2 - 5 Years"},{"date":"1 - Jun - 2019","skills":"ASP .Net, C#, SQL Server, HTML/ Java Script/ CSS","qualification":"BCA/BCS, B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Digital Info Bytes, 7th Floor, Nyati Emporius, Above VOLVO Showroom Near Orchid Hotel, Radha chowk. Pune Bengaluru Highway Baner, Pune - 411 045","profile":".Net and WPF Developer \nDigital Info Bytes","description":"We are looking for professionals to join our fantastic team to develop custom applications and websites for our esteemed clients. The ideal candidate will have hands-on experience in building complex business solutions using the Microsoft technology stack. The candidate should be able to demonstrate strong knowledge of object-oriented concepts and best practices. 1. You have strong technical skills in ASP .Net, C#, SQL Server, HTML/ Java Script/ CSS 2. You can work on your own with little or no help. 3. You possess a great eye for details. 4. You can follow specifications to create the exact product as specified in specifications 5. You write maintainable, modular and best performance code. 6. You enjoy troubleshooting and solving day to day technical problems. 7. You are eager to learn and master new technologies. Preferable:- 1. You know any of these technologies - Sharepoint / Azure. Candidate must have experience on:- *OOPS *ASP.NET *C# *JQuery *WPF *Good communication skills Walk-in Date/ Time; 1st June 2019, 10 AM onwards Interview Venue: Digital Info Bytes, 7th Floor, Nyati Emporius, Above VOLVO Showroom Near Orchid Hotel, Radha chowk. Pune Bengaluru Highway Baner, Pune - 411 045 Interview duration - 30 Minutes machine test. Note- Those who have attended in the last 6 months are not eligible for the opening","location":"Pune","experience":"1 - 3 Years"},{"date":"1 - Jun - 2019","skills":"QA Automation Selenium Automation Testing SOAP Rest Java SQL Test Scripts","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"e-Zest Solutions Limited, 2nd floor, Anand Nilay Business Center, Near Karve Statue, Karve Road, Kothrud, Pune, Maharashtra - 411 029","profile":"Automation Testing Engineer \ne-Zest Solutions Limited","description":"Candidate should have 3 to 7 years of good hands on experience in developing test scripts, execution using Ready API/SOAPU UI and selenium tool. Must have good exposure to testing concepts. Should have experience in Testing of Web Services (REST or SOAP) is mandatory. Experience in integrating test automation fully into the Continuous integration chain Experience on version control tool SVN or GitHub Exposure to SQL / Couch base database Walk-in Date/ Time: 1st June 2019, 11 AM onwards Interview Venue: e-Zest Solutions Limited 2nd floor, Anand Nilay Business Center, Near Karve Statue, Karve Road, Kothrud, Pune, Maharashtra - 411 029","location":"Pune","experience":"3 - 7 Years"},{"date":"3, 4 - Jun - 2019","skills":".Net technologies","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"QX Global Services LLP, 201, GNFC Info Tower S.G Road, Bodakdev, Gujarat, Ahmedabad, Gujarat - 380 054","profile":".NET Developer \nQX Global Services LLP","description":"Candidate should be BE/ B.Tech/ M.Tech or MCA with 1 to 5 years of experience in .Net development Walk-in Date/ Time: 3rd June - 4th June , 1 PM onwards Interview Venue: QX Global Services LLP 201, GNFC Info Tower S.G Road, Bodakdev, Gujarat, Ahmedabad, Gujarat - 380 054","location":"Ahmedabad","experience":"1 - 5 Years"},{"date":"3, 4, 5, 6, 7 - Jun - 2019","skills":"ASP .Net, C#, SQL Server","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"NeST Information Technologies Pvt. Limited, NeST Tech Park 8/837, Near Infopark, Thengode P.O, Kochi - 682 030","profile":"ASP .Net Developer \nNeST Information Technologies Pvt. Limited","description":"Work Experience : 3 to 7 Years Required Skills: ASP .Net, C#, SQL Server Developer Must have willingness to take onsite opportunity Walk-in Date/ Time: 3rd - 7th June 2019 from 9 AM onwards Interview Venue: NeST Information Technologies Pvt. Limited NeST Tech Park 8/837, Near Infopark, Thengode P.O, Kochi - 682 030","location":"Kochi","experience":"3 - 7 Years"},{"date":"15 - Jun - 2019","skills":"C#, JAVA, C++","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Syncfusion Software Private Limited, Eymard Complex, AJ217, 4th Avenue, Shanthi Colony, Anna Nagar, Chennai - 600 040.","profile":".Net Developers \nSyncfusion Software Private Limited","description":"Eligibility Criteria: BE/ B.Tech, ME/ M.Tech, M.Sc, MCA 2019 pass-outs with minimum 65% in all academics 75% in 12th No gaps of any kind Skills Required: Expertise in one or more of the following platforms or languages - C#, JAVA, C++ Job Responsibility: Develop and maintain components and applications for the web, desktop and mobile platforms. Work with some of the best UI/UX designers in the world to craft Stunning user interfaces. Regular appraisals to ensure quick growth if you deliver on the job. Walk-in Date: 15th June 2019 Timings : 10:00 AM to 2:00 PM Interview Venue: Syncfusion Software Private Limited, Eymard Complex, AJ217, 4th Avenue, Shanthi Colony, Anna Nagar, Chennai - 600 040. Landline : 044-26210413 Extension : 413","location":"Chennai","experience":"0 - 1 Years"},{"date":"1 - Jun - 2019","skills":"Manual Testing, functional testing, integration testing, regression testing","qualification":"B.E./B.Tech, MCA/PGDCA","address":"BancTec India Pvt Ltd (Now a part of Exela Technologies) 9th Floor, ICC Tech Park (Above Pantaloons), Senapati Bapat Road, Pune - 411 016","profile":"Manual Testing Engineer \nExela Technologies","description":"Candidate should have 3 to 5 year experience as a Software Tester. Must have good hands-on experience with functional testing, integration testing, regression testing, mobile testing, cross platform testing, component testing, UI/UX testing. Good if worked on security testing, performance testing, and Automation testing using Selenium. ISTQB certification is a plus. Strong analytical and problem solving abilities. Solid understanding of the software development lifecycle. Up-to-date knowledge of the latest testing developments. Excellent verbal and written communication in language. Degree in Computer Science or relevant fields. QA Tester Responsibilities include: Review of software requirements Preparation/review of test plans Preparation/review of test cases Execution of tests Reporting of defects Preparation of test reports Only immediate joiners can apply. If you hold similar experience as per our requirement then please walk-in to our premises for the next round from 1st June 2019 in between 10:30 AM to 2 PM on the below address:- BancTec India Pvt Ltd ( Now a part of Exela Technologies) 9th Floor, ICC Tech Park (Above Pantaloons), Senapati Bapat Road, Pune - 411 016 Contact : Chandni -20-67437573 Date : 1st June 2019 Time - 10:30 AM to 2 PM","location":"Pune","experience":"3 - 5 Years"},{"date":"3, 4, 5, 6, 7 - Jun - 2019","skills":"Automation Testing Framework, Selenium, Java, C#, BDD, TDD, Jenkins, Cucumber.","qualification":"B.E./B.Tech, M.Tech, MCA/PGDCA","address":"Xceedance Consulting India Pvt. Limited, 5th floor, Candor Gurgaon, One Projects Pvt. Limited, SEZ Building No. 6, Village Tikri, Sector 48, Gurgaon, Haryana - 122 018","profile":"QA Automation Tester (Selenium) \nXceedance Consulting India Pvt. Limited","description":"Candidate should have strong hands-on experience in implementing end-to-end test automation framework. Must be strong in automation tools like Selenium (Java/Any other), Rest APIs testing, cucumber. Knowledge of different automation frameworks like BDD and TDD. Experience on implementing integration with different tools, like test case management tool, CI tool, cloud-based test platform. Very strong in any programming language Java, C#, etc. Basics, OOPS concepts and Data Types should be very clear. Walk-in Date/ Time: 3rd - 7th June , 11 AM onwards Interview Venue: Xceedance Consulting India Pvt. Limited 5th floor, Candor Gurgaon, One Projects Pvt. Limited, SEZ Building No. 6, Village Tikri, Sector 48, Gurgaon, Haryana - 122 018","location":"Gurgaon","experience":"3 - 5 Years"},{"date":"1 - Jun - 2019","skills":"Java Concepts, Hibernate and Springs, Angular JS","qualification":"B.E./B.Tech","address":"Cross Country Infotech Private Limited, 3rd Floor, Sr No 169/1, Sector II, Building D, West End Centre III, Aundh, Pune - 411 007 (Nearest Landmark Convergys Building)","profile":"Software Testing/ Freshers \nCross Country Infotech Pvt. Limited","description":"Eligibility Criteria: B.E/ B.Tech with strong programming capabilities Passed out from 2017, 2018, 2019 batch Minimum 60% marks throughout education, without any gap. Strong verbal and written communication skills. DST (Diploma in Software Testing) / ISTQB preferred Walk-in Date: June 1, 2019 Time: 10.00 am to 3.00 pm Venue Details: Cross Country Infotech Private Limited 3rd Floor, Sr No 169/1, Sector II, Building D, West End Centre III, Aundh, Pune - 411 007 (Nearest Landmark Convergys Building) Tel: 7276610004/ 03 Mandatory Documents Required: Latest Updated CV AADHAR Card","location":"Pune","experience":"0 - 1 Years"}]}